# BadReferenceToSecondary Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..BadReferenceToSecondary Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
No element in a secondary Option can be referenced by an element outside that Option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadReferenceToSecondary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadReferenceToSecondary As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadReferenceToSecondary {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace